status/2020/17oct20.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-28 Sat 07:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>10 October 2020 - 17 October 2020</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">10 October 2020 - 17 October 2020</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org378f883">1. Live Oak Weather Station</a>
<ul>
<li><a href="#orgc0e5f12">1.1. RIOT veml6075 UV sensor driver complete</a></li>
<li><a href="#org2b5ecc9">1.2. All sensors interfaced to Nucleo-F303re</a></li>
<li><a href="#org213cf77">1.3. SPI transmitter interface started</a></li>
</ul>
</li>
<li><a href="#orgc57b678">2. Alum Rock Data Center</a>
<ul>
<li><a href="#orgbae91e8">2.1. Added SPF records to GMP DNS</a></li>
<li><a href="#org0136e4b">2.2. Added google-site-verification TXT record</a></li>
</ul>
</li>
<li><a href="#orgb141cec">3. Skywater 130</a></li>
<li><a href="#orgbb23b89">4. Interesting reading</a></li>
<li><a href="#orgbb86a5a">5. CA Election Law fun</a></li>
</ul>
</div>
</div>
<p>
Loma Preita Day
<a href="https://en.wikipedia.org/wiki/1989_Loma_Prieta_earthquake">https://en.wikipedia.org/wiki/1989_Loma_Prieta_earthquake</a>
</p>

<div id="outline-container-org378f883" class="outline-2">
<h2 id="org378f883"><span class="section-number-2">1.</span> Live Oak Weather Station</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc0e5f12" class="outline-3">
<h3 id="orgc0e5f12"><span class="section-number-3">1.1.</span> RIOT veml6075 UV sensor driver complete</h3>
</div>
<div id="outline-container-org2b5ecc9" class="outline-3">
<h3 id="org2b5ecc9"><span class="section-number-3">1.2.</span> All sensors interfaced to Nucleo-F303re</h3>
</div>
<div id="outline-container-org213cf77" class="outline-3">
<h3 id="org213cf77"><span class="section-number-3">1.3.</span> SPI transmitter interface started</h3>
</div>
</div>

<div id="outline-container-orgc57b678" class="outline-2">
<h2 id="orgc57b678"><span class="section-number-2">2.</span> Alum Rock Data Center</h2>
<div class="outline-text-2" id="text-2">
<p>
Long overdue DNS update to avoid my outgoing email from being marked as
"spam" by Google Gmail. Thanks to Elena for bringing this to my
attention.
</p>
</div>

<div id="outline-container-orgbae91e8" class="outline-3">
<h3 id="orgbae91e8"><span class="section-number-3">2.1.</span> Added SPF records to GMP DNS</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="http://www.open-spf.org/SPF_Record_Syntax/">http://www.open-spf.org/SPF_Record_Syntax/</a>
<a href="https://support.google.com/a/answer/33786">https://support.google.com/a/answer/33786</a>
<a href="https://support.google.com/mail/answer/81126">https://support.google.com/mail/answer/81126</a>
</p>
</div>
</div>
<div id="outline-container-org0136e4b" class="outline-3">
<h3 id="org0136e4b"><span class="section-number-3">2.2.</span> Added google-site-verification TXT record</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<a href="https://support.google.com/mail/answer/6227174">https://support.google.com/mail/answer/6227174</a>
</p>
</div>
</div>
</div>

<div id="outline-container-orgb141cec" class="outline-2">
<h2 id="orgb141cec"><span class="section-number-2">3.</span> Skywater 130</h2>
<div class="outline-text-2" id="text-3">
<p>
Initial Framework released
<a href="https://github.com/efabless/caravel">https://github.com/efabless/caravel</a>
</p>

<p>
Looks like it has a SPI block I can use as a reference.
</p>

<p>
I'm not sure I have enough time to put something together for the
Nov. shuttle - not that I expect it would be accepted, but I think
it's worth it to at least give it a whirl.
</p>
</div>
</div>


<div id="outline-container-orgbb23b89" class="outline-2">
<h2 id="orgbb23b89"><span class="section-number-2">4.</span> Interesting reading</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="https://www.mattblaze.org/blog/neinnines/">https://www.mattblaze.org/blog/neinnines/</a>
</p>
</div>
</div>

<div id="outline-container-orgbb86a5a" class="outline-2">
<h2 id="orgbb86a5a"><span class="section-number-2">5.</span> CA Election Law fun</h2>
<div class="outline-text-2" id="text-5">
<p>
See generally
</p>

<p>
<a href="https://oag.ca.gov/news/press-releases/attorney-general-becerra-and-secretary-state-padilla-send-cease-and-desist">https://oag.ca.gov/news/press-releases/attorney-general-becerra-and-secretary-state-padilla-send-cease-and-desist</a>
</p>

<p>
about "unofficial ballot drop off boxes".
</p>

<p>
Seems to me that "Secure Ballot Drop Off Location" (attachment 1A) is
OK but not "Official Ballot Drop Off Box" (attachment 3 and 4A) if in
fact it is not "Official".
</p>

<p>
Interesting factoid: There is apparently a difference between the
Santa Clara County and Santa Cruz County mail-in ballot design where
(according to Trish's memory - she sent her ballot in already) on the
Santa Cruz ballot, the "Ballot Signature" section and the "Voter
Authorization" section (for designating a third party to return the
ballot) are <b>under</b> a sealable flap. Santa Clara County has it
<b>outside</b> the sealable flap.
</p>

<p>
Section 3011 says what's on the ballot envelope, not the construction
</p>

<p>
<a href="http://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?sectionNum=3011&amp;lawCode=ELEC">http://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?sectionNum=3011&amp;lawCode=ELEC</a>
</p>

<p>
Interestingly, 3011.11(c) says
</p>

<p>
"Notwithstanding paragraphs (9) to (11), inclusive, of subdivision
(a), a ballot shall not be disqualified solely because the person
authorized to return it did not provide on the identification envelope
his or her name, relationship to the voter, or signature."
</p>

<p>
Section 3017 says how to deliver the ballot
</p>

<p>
<a href="http://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?sectionNum=3017&amp;lawCode=ELEC">http://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?sectionNum=3017&amp;lawCode=ELEC</a>
</p>

<p>
and one of the ways is
</p>

<p>
"Designate a person to return the ballot to the elections official
who issued the ballot&#x2026;"
</p>

<p>
Nothing is said about whether the "Voter Authorization" for such
designation is witnessed by the voter or not. Seems that the Santa
Cruz County ballot envelope construction facilitates such witnessing;
Santa Clara County ballot envelope construction does not.
</p>

<p>
Not sure what the point of "Voter Authorization" is now, given
3011.11(c).
</p>

<p>
See history of AB 306 which caused 3011.11(c).
</p>

<p>
<a href="https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=201720180AB306">https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=201720180AB306</a>
</p>

<p>
Clearly, the requirements of "Voter Authorization" have been diluted
over time, from "member of household" to apparently "anybody".
</p>

<p>
As long as the drop off box doesn't claim to be an official county
election drop off box, I can't see how an unofficial drop off box would
be illegal, as long as the ballots are delivered to election officials
before the close of polls in accordance applicable CA election law, as
there is no longer any penalty for delivering such ballots three days
after they were dropped off or without a "Voter Authorization"
signature.
</p>

<p>
It would be amusing if the political party that voted against AB 306
is able to use 3011.11(c) in their favor.
</p>

<p>
It would also be amusing if the ballots from the unofficial ballot
drop off boxes were mailed in to avoid a potentially unpleasant
conversation with an election official.
</p>

<p>
I look forward to any lawsuits that would answer this question.
</p>

<p>
Update:
</p>

<p>
<a href="https://www.sos.ca.gov/administration/news-releases-and-advisories/2020-news-releases-and-advisories/ap20099-title">https://www.sos.ca.gov/administration/news-releases-and-advisories/2020-news-releases-and-advisories/ap20099-title</a>
</p>

<p>
According to the press release, the issue is "chain of custody", but what I
don't see is what specific law is being broken.
</p>

<p>
Also
</p>

<p>
<a href="https://calvoter.org/content/cvf-resources-voters-and-upcoming-events">https://calvoter.org/content/cvf-resources-voters-and-upcoming-events</a>
</p>

<p>
and
</p>

<p>
<a href="https://www.abc10.com/article/news/politics/elections/yes-ballot-harvesting-is-legal-in-california/103-067a65c5-9bde-4ff4-a815-97dee5597597">https://www.abc10.com/article/news/politics/elections/yes-ballot-harvesting-is-legal-in-california/103-067a65c5-9bde-4ff4-a815-97dee5597597</a>
</p>

<p>
referenced therein.
</p>

<p>
Kim Alexander's point that there's a "grey area" in California
Election law with respect to chain of custody requirements is well
taken.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-01-28 Sat 07:04</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
